load/data/log_2025-02-07_08:21:42_200_ethz.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ethz.js
        output: csv (data/data_2025-02-07_08:21:42_200_ethz.csv)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * ethz: 200 looping VUs for 30s (exec: run, gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 297 complete and 0 interrupted iterations
ethz   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 1279 complete and 0 interrupted iterations
ethz   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 2295 complete and 0 interrupted iterations
ethz   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 3309 complete and 0 interrupted iterations
ethz   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 4384 complete and 0 interrupted iterations
ethz   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 5399 complete and 0 interrupted iterations
ethz   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 6476 complete and 0 interrupted iterations
ethz   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 7565 complete and 0 interrupted iterations
ethz   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 8601 complete and 0 interrupted iterations
ethz   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 9660 complete and 0 interrupted iterations
ethz   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 10754 complete and 0 interrupted iterations
ethz   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 11829 complete and 0 interrupted iterations
ethz   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 12835 complete and 0 interrupted iterations
ethz   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 13905 complete and 0 interrupted iterations
ethz   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 14999 complete and 0 interrupted iterations
ethz   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 16049 complete and 0 interrupted iterations
ethz   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 17123 complete and 0 interrupted iterations
ethz   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 18154 complete and 0 interrupted iterations
ethz   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 19177 complete and 0 interrupted iterations
ethz   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 20235 complete and 0 interrupted iterations
ethz   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 21304 complete and 0 interrupted iterations
ethz   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 22404 complete and 0 interrupted iterations
ethz   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 23530 complete and 0 interrupted iterations
ethz   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 24550 complete and 0 interrupted iterations
ethz   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 25623 complete and 0 interrupted iterations
ethz   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 26671 complete and 0 interrupted iterations
ethz   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 27721 complete and 0 interrupted iterations
ethz   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 28825 complete and 0 interrupted iterations
ethz   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 29883 complete and 0 interrupted iterations
ethz   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 30937 complete and 0 interrupted iterations
ethz   [ 100% ] 200 VUs  30.0s/30s

     ✓ is status 200

     checks.........................: 100.00% 31161 out of 31161
     data_received..................: 2.1 GB  70 MB/s
     data_sent......................: 4.0 MB  134 kB/s
     http_req_blocked...............: avg=2.72ms   min=1.81µs  med=3.15µs   max=985ms    p(90)=4.52µs   p(95)=15.5µs  
     http_req_connecting............: avg=84.34µs  min=0s      med=0s       max=24.3ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=192.48ms min=12.23ms med=183.33ms max=1.18s    p(90)=296.01ms p(95)=331.35ms
       { expected_response:true }...: avg=192.48ms min=12.23ms med=183.33ms max=1.18s    p(90)=296.01ms p(95)=331.35ms
     http_req_failed................: 0.00%   0 out of 31161
     http_req_receiving.............: avg=154.47ms min=2.02ms  med=147.14ms max=540.08ms p(90)=256.29ms p(95)=288.74ms
     http_req_sending...............: avg=2.5ms    min=4.5µs   med=7.34µs   max=942.75ms p(90)=20.59µs  p(95)=31.68µs 
     http_req_tls_handshaking.......: avg=147.55µs min=0s      med=0s       max=49.59ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=35.51ms  min=5.36ms  med=31.99ms  max=648.61ms p(90)=59.59ms  p(95)=70.3ms  
     http_reqs......................: 31161   1035.674387/s
     iteration_duration.............: avg=192.82ms min=12.43ms med=183.43ms max=1.22s    p(90)=296.13ms p(95)=331.68ms
     iterations.....................: 31161   1035.674387/s
     vus............................: 200     min=200            max=200
     vus_max........................: 200     min=200            max=200


running (0m30.1s), 000/200 VUs, 31161 complete and 0 interrupted iterations
ethz ✓ [ 100% ] 200 VUs  30s